---
kind: type
id: T:Autodesk.Revit.DB.FilterNumericGreater
source: html/b317951e-6324-fc45-5860-6b616534d1ce.htm
---
# Autodesk.Revit.DB.FilterNumericGreater

Tests whether numeric values from the document are greater than a certain value

## Syntax (C#)
```csharp
public class FilterNumericGreater : FilterNumericRuleEvaluator
```